JohnDTX/irix-3.x-src/man/trash/standard/a_man/man1/ff.1m
.tr ~ 
.TH FF 1M
.SH NAME
f\&f \- list file names and statistics for a file system
.SH SYNOPSIS
.B /etc/f\&f
[options] special 
.SH DESCRIPTION
.I Ff\^
reads the i-list and directories of the 
.I special\^ 
file, assuming it to be a file system,
saving i-node data for files which match the selection criteria.
Output consists of the path name for each saved i-node, plus 
any other file information requested
using the print \f2options\fP below.
Output fields are positional.
The output is produced in i-node order; fields are separated by tabs.
The default line produced by
.I f\&f
is:
.IP
path-name \|i-number
.PP
With all \f2options\fP enabled, output
fields would be:
.IP
path-name \|i-number \|size \|uid
.PP
The argument
.I n
in the \f2option\fP descriptions that follow is used 
as a decimal integer (optionally signed), where
.BI + n\^
means more than
.IR n ,
.BI \- n\^
means less than
.IR n ,
and 
.I n\^
means exactly
.IR n \.
A day is defined as a 24 hour period.
.TP "\w'\f3-i\f2 i-node-list\f1\ \ 'u"
.B \-I
Do not print the i-node number after each path name.
.TP
.B \-l
Generate a supplementary list of all path names for multiply linked
files.
.TP
.BI \-p ~prefix\^
The specified
.I prefix\^
will be added to each generated path name.
The default is
.BR \&. . 
.TP
.B \-s
Print the file size, in bytes, after each path name.
.TP
.B \-u
Print the owner's login name after each path name.
.TP
.BI \-a ~n
Select if the i-node has been accessed in
.I n\^
days.
.TP
.BI \-m ~n\^
Select if the i-node has been modified in
.I n\^
days.
.TP
.BI \-c ~n\^
Select if the i-node has been changed in 
.I n\^
days.
.TP
.BI \-n ~file\^
Select if the i-node has been modified more recently than the argument
.IR file .
.TP
.BI \-i "~i-node-list"
Generate names for only those i-nodes specified in
.IR "i-node-list" .
.SH EXAMPLE
.IP
f\&f \|\-I \|/dev/diskroot
.PP
generates a list of the names of all files on a specified file system.
.IP
f\&f \|\-m \|\-1 \|/dev/diskusr \|> \|/log/incbackup/usr/tuesday
.PP
produces an index of files and i-numbers which are on a
file system and have been modified in the last 24 hours.
.IP
f\&f \|\-i \|451,76 \|/dev/rrp7
.PP
obtains the path names for i-nodes 451 and 76 on
a specified file system.
.SH "SEE ALSO"
finc(1M), find(1), frec(1M), ncheck(1M).
.SH BUGS
Only a single path name out of any possible ones will be generated for a multiply
linked i-node, unless the
.B \-l
option is specified.
When
.B \-l
is specified, no selection criteria apply to the names generated.
All possible names for every linked file on the file system will be included
in the output.
.PP
On very large file systems, memory may run out before
.I f\&f
does.
.tr ~~
.\"	@(#)ff.1m	5.1 of 10/17/83
