JohnDTX/irix-3.x-src/man/trash/standard/a_man/man1/il.7
.TH IL 7
.SH NAME
il \- Interlan 10 Mb/s Ethernet interface
.SH SYNOPSIS
.B "device il0 at uba0 csr 161000 vector ilrint ilcint"
.SH DESCRIPTION
The
.I il
interface provides access to a 10 Mb/s Ethernet network through
an Interlan controller.
.PP
The host's Internet address is specified at boot time with an SIOCSIFADDR
ioctl.  The
.I il
interface employs the address resolution protocol described in
.IR arp (4P)
to dynamically map between Internet and Ethernet addresses on the local
network.
.PP
The interface normally tries to use a ``trailer'' encapsulation
to minimize copying data on input and output.  This may be
disabled, on a per-interface basis, by setting the IFF_NOTRAILERS
flag with an SIOCSIFFLAGS ioctl.
.SH DIAGNOSTICS
\f3il%d: input error\fP.  The hardware indicated an error
in reading a packet off the cable or an illegally sized packet.
.PP
\f3il%d: can't handle af%d\fP.  The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
.SH SEE ALSO
sgboot(1M),
sgbounce(1M),
xcp(1C),
xlogin(1C),
xnsd(1M),
xx(1C),
xcmd(3X),
xconnect(3X),
xnsfile(3X),
xnsioctl(2),
xnslib(3X),
xnswrite(3X)
