JohnDTX/irix-3.x-src/man/trash/standard/a_man/man1/mt.7
.TH MT 7
.SH NAME
mt \- TM78/TU-78 MASSBUS magtape interface
.SH SYNOPSIS
.B master mt0 at mba? drive ?
.br
.B tape mu0 at mt0 slave 0
.SH DESCRIPTION
The tm78/tu-78 combination provides a standard tape drive
interface as described in
.IR smtio (7).
Only 1600 and 6250 bpi are supported;
the TU-78 runs at 125 ips and autoloads tapes.
.SH "SEE ALSO"
mt(7),
tar(1),
tp(1)
.SH DIAGNOSTICS
\f3mu%d: no write ring\f1.  An attempt was made to write on the tape drive
when no write ring was present; this message is written on the terminal of
the user who tried to access the tape.
.PP
\f3mu%d: not online\f1.  An attempt was made to access the tape while it
was offline; this message is written on the terminal of the user
who tried to access the tape.
.PP
\f3mu%d: can't switch density in mid-tape\f1.  An attempt was made to write
on a tape at a different density than is already recorded on the tape.
This message is written on the terminal of the user who tried to switch
the density.
.PP
\f3mu%d: hard error bn%d mbsr=%b er=%x ds=%b\f1.   A tape error occurred
at block \f2bn\f1; the mt error register and drive status register are
printed in octal with the bits symbolically decoded.  Any error is
fatal on non-raw tape.  When possible the driver will retry
the operation which failed several times before reporting the error.
.PP
\f3mu%d: blank tape\fP.
An attempt was made to read a blank tape (a tape without even
end-of-file marks).
.PP
\f3mu%d: offline\fP.
During an I/O operation the device was set offline.  If a
non-raw tape was used in the access it is closed.
.SH BUGS
If any non-data error is encountered on non-raw tape,
it refuses to do anything more until closed.
