JohnDTX/irix-3.x-src/man/troff/u_man/man4/postscrip.4
'\"macro stdmacro
.TH POSTSCRIPT 4 
.SH NAME
postscript \- print file format
.SH DESCRIPTION
The P\s-2OST\s+2S\s-2CRIPT\s+2 print file format
is a programming language with powerful graphics primitives
for describing printed pages.  A growing number of
devices which print P\s-2OST\s+2S\s-2CRIPT\s+2
page descriptions are available.
P\s-2OST\s+2S\s-2CRIPT\s+2 printers include the Apple LaserWriter,
QMS PS-800, 1200, and 2400,
Dataproducts LZR-2665 and 2660, and Linotype Linotronic 100 and 300 
typesetters.  The T\s-2RAN\s+2S\s-2CRIPT\s+2 package of UNIX software
allows UNIX systems
access to P\s-2OST\s+2S\s-2CRIPT\s+2 printers.
.LP
The complete P\s-2OST\s+2S\s-2CRIPT\s+2 language is described in the book
.RS
\f2 P\s-2OST\s+2S\s-2CRIPT\s+2 Language Reference Manual\f1
.br
by Adobe Systems Incorporated
.br
published by Addison-Wesley Publishing Company
.br
ISBN 0-201-10174-2, 322 pages, illustrated
.br
Library of Congress: QA76.73.P67P67  1985  005.13'3  85-15693
.RE
.PP
The Reference Manual provides a comprehensive presentation of
of the language, its graphics, and its font facilities,
including the precise semantics of every P\s-2OST\s+2S\s-2CRIPT\s+2 operator.
Also covered are a set of P\s-2OST\s+2S\s-2CRIPT\s+2 
.I
file structuring conventions
which are used by the T\s-2RAN\s+2S\s-2CRIPT\s+2 system components.
.SH "SEE ALSO"
enscript(1)
.SH AUTHOR
Adobe Systems Incorporated
.SH NOTES
P\s-2OST\s+2S\s-2CRIPT\s+2 and T\s-2RAN\s+2S\s-2CRIPT\s+2 are trademarks
of Adobe Systems Incorporated.
