JohnDTX/irix-3.x-src/man/a_man/man1/hyroute.1m
'\"macro stdmacro
.TH HYROUTE 1M
.SH NAME
hyroute \- set the hyperchannel routing tables
.SH SYNOPSIS
.B hyroute
[
.B \-s
] [
.B \-p
] [
.B \-c
] [
.B \-l
] [
.B \-d
] [
file
]
.br
.SH DESCRIPTION
.I Hyroute
manipulates the hyperchannel routing information.
.PP
With the
.B \-s
option, it reads 
.I file
and sets the system's database according to the information in the file (see below).
If no input file is given, or if the argument `\-' is encountered,
.I hyroute
reads from standard input.
.PP
The
.B \-c
option causes 
.I
hyroute
to compare the system's current information to
that contained in
.IR file .
.PP
The
.B \-p
option causes a digested version of
.I file
to be printed.
.PP
The
.B \-d
option causes a "dump" of the system's table (used for debugging routing code).
.SH "FILE FORMAT"
The input file is free format.
Comment lines start with a '\(**' in column one.
Statements end with a semicolon.
.PP
.ti +1i
.B direct
.I host dest control access
.B \;
.PP
Describes a host that can be directly reached from this adapter.
.I Host
is a host name as listed 
.BR /etc/hosts ,
.IR dest ,
.IR control ,
and
.I access
are hexadecimal numbers.
The data will be sent to hyperchannel address
.I dest
using a control
value of
.I control
and an access code of
.I access
(see adapter manuals for details).
.PP
The specified remote adapter and the local adapter must both be connected to
one or more common trunks
or connected to trunks that are connected with with link adapters.
.PP
.ti +1i
.B gateway
.I host gate1 gate2 gate3 ...
.B \;
.PP
Describes a host that must be reached indirectly through any one of the hosts indicated by
.IR gate n.
The hosts listed are not gateways in the formal sense
(they don't run the internet gateway protocols),
but are hosts on the hyperchannel can "bridge" between subsections of the hyperchannel network.
.PP
A sample file follows:
.PP
.in +1i
.nf
\(** comment
direct azure	6100 0 0;
direct bronze	6101 0 0;
direct cyber	2100 1100 0;
direct dadcad	6102 0 0;
direct tekcad	2400 1100 0;
direct tekcrd	2201 1100 0;
direct tekid	2500 1100 0;
direct teklabs	2200 1100 0;
gateway iddic	tekcrd teklabs cyber tekcad tekid;
gateway iddme	tekcrd teklabs cyber tekcad tekid;
gateway metals	tekcrd teklabs cyber;
.in -1i
.fi
.PP
.SH "SEE ALSO"
hyp(1M)
.SH FILES
.ta \w'/usr/etc/hyroute.tab\ \ \ 'u
/usr/etc/hyroute.tab	routing table expected for initialization by
.IR /etc/rc.tcp .
.br
/dev/hy\(**	character special file to get to the interface (only has an 
.I ioctl 
entry)
.SH AUTHOR
Steve Glaser, Tektronix Inc.
