JohnDTX/irix-3.x-src/man/a_man/man1/portmap.1m
'\"macro stdmacro
.TH PORTMAP 1M
.SH NAME
portmap \- DARPA port to RPC program number mapper
.SH SYNOPSIS
.B /usr/etc/portmap
.SH DESCRIPTION
.IX  "portmap command"  ""  "\fLportmap\fP \(em DARPA to RPC mapper"
.IX  "DARPA to RPC mapper"  ""  "DARPA to RPC mapper \(em \fLportmap\fP"
.I Portmap
is a server that converts RPC program numbers
into DARPA protocol port numbers.
It must be running in order to make RPC calls.
.PP
When an RPC server is started, it will tell
.I portmap
what port number it is listening to,
and what RPC program numbers it is prepared to serve.
When a client wishes to make an RPC call to a given program number,
it will first contact
.I portmap
on the server machine to determine
the port number where RPC packets should be sent.
.PP
Normally, standard RPC servers are started by
.IR inetd (1M),
so
.I portmap
must be started before
.I inetd
is invoked.
.SH "SEE ALSO"
rpcinfo(1M), inetd(1M)
.SH BUGS
If
.I portmap
crashes, all servers must be restarted.
