JohnDTX/irix-3.x-src/man/a_man/man1/timed.1m
'\"macro stdmacro
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)timed.1M	6.1 (Berkeley) 5/28/86
.\"
.TH TIMED 1M
.UC 6
.ad
.SH NAME
timed \- time server daemon
.SH SYNOPSIS
.B /usr/etc/timed
[ 
.B \-t 
] [
.B \-M 
] [
.B \-F 
host1 host2 ... ] [
.B \-n 
network ]
.br
[
.BR \-i " network ]"
.SH DESCRIPTION
.I Timed
is the time server daemon and is normally invoked
at boot time from the
.I /etc/rc.tcp
file.  
It synchronizes the host's time with the time of other
machines in a local area network running 
.IR timed .
These time servers will slow down the clocks of some machines
and speed up the clocks of others to bring them to the average network time.
The average network time is computed from measurements of clock differences
using the ICMP timestamp request message.
.PP
The service provided by \f2timed\fP is based  on a master-slave
scheme.
When
.I timed
is started on a machine, it asks the master for the network time
and sets the host's clock to that time.
After that, it accepts synchronization messages periodically sent by
the master and calls 
.I adjtime (2)
system call
to perform the needed corrections on the host's clock.
It also communicates with
.IR date (1)
in order to set the date globally,
and with 
.IR timedc (1M),
the timed control program.
.PP
If the machine running the master crashes, then the slaves will elect
a new master from among slaves running with the 
.B \-M
flag.
A
.IR timed
running without the
.B \-M
flag will remain a slave.
The 
.B \-F
flag means only the local machine and the machines
.I host1, host2,
etc., are trusted to have good hardware clocks and to be securely
administered.  Any attempts to change the clocks by other
machines will be ignored.
The 
.B \-t 
flag enables \f2timed\fP to trace the messages it receives in the
file 
.IR /usr/adm/timed.log .
Tracing can be turned on or off by the program
.IR timedc (1M).
.I Timed
normally checks for a master time server on each network to which
it is connected, except as modified by the options described below.
It will request synchronization service from the first master server
located.
If permitted by the
.B \-M
flag, it will provide synchronization service on any attached networks
on which no current master server was detected.
Such a server propagates the time computed by the top-level master.
The 
.B \-n 
flag, followed by the name of a network which the host is connected to
(see
.IR networks (4)),
overrides the default choice of the
network addresses made by the program.
Each time the
.B \-n
flag appears, that network name is added to a list of valid networks.
All other networks are ignored.
The 
.B \-i 
flag, followed by the name of a network to which the host is connected,
overrides the default choice of the network addresses made by the program.
Each time the
.B \-i
flag appears, that network name is added to a list of networks to ignore.
All other networks are used by the time daemon.
The
.B \-n
and 
.B \-i
flags are meaningless if used together.
.SH FILES
.nf
.ta \w'/usr/adm/timed.masterlog     'u
/usr/adm/timed.log		tracing file for \f2timed\f1
/usr/adm/timed.masterlog	log file for master \f2timed\f1 
.fi
.SH "SEE ALSO"
date(1), adjtime(2), gettimeofday(3B), icmp(7P), timedc(1M),
.br
\f2TSP: The Time Synchronization Protocol for UNIX 4.3BSD\fP, 
R. Gusella and S. Zatti

