JohnDTX/irix-3.x-src/man/a_man/man1/uuclean.1m
'\"macro stdmacro
.TH UUCLEAN 1M
.SH NAME
uuclean \- uucp spool directory clean-up
.SH SYNOPSIS
.B /usr/lib/uucp/uuclean
[ options ]
.SH DESCRIPTION
.I Uuclean\^
will scan the spool directory for files with the
specified prefix and delete all those which are
older than the specified number of hours.
.PP
The following options are available.
.TP \w'\f3\-d\f2directory\ \ 'u
.TP
.BI \-d directory\^
Clean
.I directory\^
instead of the spool directory.
.TP
.BI \-p pre\^
Scan for files with
.I pre\^
as the file prefix.
Up to 10
.B \-p
arguments may be specified.
A
.B \-p
without any
.I pre\^
following will cause all files older than the
specified time to be deleted.
.TP
.BI \-n time\^
Files whose age is more than
.I time\^
hours will be deleted if the prefix
test is satisfied.
(default time is 72 hours)
.TP
.BI \-w file\^
The default action for
.I uuclean\^
is to remove files which
are older than a specified time (see
.B \-n
option).
The
.B \-w
option is used
to find those files older
than
.I time\^
hours, however, the files are not deleted.
If the argument
.I file\^
is present the warning is placed in
.IR file ,
otherwise, the warnings will go to the standard output.
.TP
.BI \-s sys\^
Only files destined for system
.I sys\^
are examined.
Up to 10
.B \-s
arguments may be specified.
.TP
.BI \-m file\^
The 
.B \-m
option sends
mail to the owner of the file
when it is deleted.
If a 
.I file
is specified then an entry is placed 
in
.I file.
.PP
This program is typically started by
.IR cron (1M).
.SH EXAMPLE
.IP
uuclean -pT -pRC -n0 -m
.PP
removes all files in 
.B /usr/spool/uucp
with a prefix of T or RC, 
and mails notifications to the owners of the removed files.
.SH FILES
.PD 0
.TP "\w'/usr/spool/uucp\ \ \ 'u"
/usr/lib/uucp
directory with commands used by
.I uuclean\^
internally
.TP
/usr/spool/uucp
spool directory
.PD
.SH SEE ALSO
cron(1M), uucp(1C), uux(1C).
.\"	@(#)uuclean.1m	5.1 of 10/17/83
