JohnDTX/irix-3.x-src/man/a_man/man1/vmstat.1m
'\"macro stdmacro
.TH VMSTAT 1M
.SH NAME
vmstat \- report virtual memory statistics
.SH SYNOPSIS
.B vmstat
[
.B \-fs
]
[ interval [ count ] ]
.de s1
.if n .sp
.if t .sp .1i
..
.de t1
.if n .ta 5n
.if t .ta 1i
..
.SH DESCRIPTION
.I vmstat\^
delves into the system and normally reports certain statistics kept about
process, virtual memory, disk, trap and CPU activity.
If given a
.B \-f
argument, it instead reports on the number of forks
since system startup and the number of pages of virtual memory involved
forking.
If given a
.B \-s
argument, it instead prints the contents
of the sum
structure, giving the total number of several kinds of paging related
events which have occurred since boot.
.PP
If none of these options are given,
.I vmstat
will report in the first line a summary of the virtual memory activity
since the system has been booted.
If
.I interval
is specified, then successive lines are summaries over the last
.I interval
seconds.
``vmstat 5'' will print what the system is doing every five seconds;
this is a good choice of printing interval since this is how often
some of the statistics are sampled in the system; others vary every
second, running the output for a while will make it apparent which
are recomputed every second.
If a
.I count
is given, the statistics are repeated
.I count
times.
The format fields are:
.PP
Procs: information about numbers of processes in various states.
.s1
.t1
.nf
r	in run queue
b	blocked for resources (I/O, paging, etc.)
w	runnable or short sleeper (\s-2<\s0 20 secs) but swapped
.fi
.s1
Memory: information about the usage of virtual and real memory.
Virtual pages are considered active if they belong to processes which
are running or have run in the last 20 seconds.
.s1
.t1
.nf
avm	active virtual memory, in K bytes
fre	size of the free list, in K bytes
.fi
.s1
A ``page'' is 4096 bytes.
.fi
.s1
Page: information about page faults and paging activity.
These are averaged each five seconds, and given in units per second.
.s1
.t1
.nf
re	page reclaims
at	text pages lost between execs
pi	pages paged in
po	pages paged out
fr	pages freed per second
de	anticipated short term memory shortfall
sr	pages scanned by clock algorithm, per-second
.fi
.s1
up/hp/rk: Disk operations per second (this field is system dependent).
Typically paging will be split across several of the available drives.
The number under each of these is the unit number.
.s1
Faults: trap/interrupt rate averages per second over last 5 seconds.
.s1
.t1
.nf
in	(non clock) device interrupts per second
sy	system calls per second
cs	cpu context switch rate (switches/sec)
.fi
.s1
Cpu: breakdown of percentage usage of CPU time
.s1
.nf
us	user time for normal and low priority processes
sy	system time
id	cpu idle
.SH FILES
.nf
.na
/dev/kmem
/vmunix
.fi
.ad
.SH AUTHORS
William Joy and Ozalp Babaoglu
.SH BUGS
There should be a screen oriented program which combines
.I vmstat
and
.IR ps (1)
in real time
as well as reporting on other system activity.
.\" @(#)$Header: /d2/3.7/src/man/a_man/man1/RCS/vmstat.1m,v 1.1 89/03/27 16:22:09 root Exp $
.\" $Log:	vmstat.1m,v $
Revision 1.1  89/03/27  16:22:09  root
Initial check-in for 3.7

.\" Revision 1.6  86/04/15  15:23:15  lori
.\" 2.4/3.4
.\" 
.\" Revision 1.5  86/03/25  14:20:49  lori
.\" kipp
.\" 
.\" Revision 1.4  86/03/25  14:11:50  lori
.\" *** empty log message ***
.\" 
.\" Revision 1.3  86/03/10  16:02:25  celia
.\" herb's edits
.\" 
.\" Revision 1.2  86/02/24  13:47:34  lori
.\" v2.0 UPM for 2.4/3.4
.\" 
.\" Revision 1.1  85/09/18  13:23:35  robinf
.\" Moved for Turbo option release from 1 to 1M
.\" 
.\" Revision 1.2  85/05/02  18:21:38  robinf
.\" Updates from 2000 Series Workstation Guide
.\" 
.\" Revision 1.1  84/12/11  13:38:27  bob
.\" Initial revision
.\" 
