JohnDTX/irix-3.x-src/usr.bin/print/trscript/man/transcript.5p
.TH TRANSCRIPT 5 "12 Nov 1985" "Adobe Systems"
\" RCSID: $Header: /d2/3.7/src/usr.bin/print/trscript/man/RCS/transcript.5p,v 1.1 89/03/27 18:20:17 root Exp $
.ds PS P\s-2OST\s+2S\s-2CRIPT\s+2
.ds TS T\s-2RAN\s+2S\s-2CRIPT\s+2
.SH NAME
pscomm, psrv, pstext, psbanner, psinterface \- T\s-2RAN\s+2S\s-2CRIPT\s+2 spooler filters for P\s-2OST\s+2S\s-2CRIPT\s+2 printers
.SH "SYNOPSIS"
.B XPSLIBDIRX/ps*
.SH "DESCRIPTION"
These are the low-level \*(TS interface filters for use by the 
System V line printer spooling system.
The
.I psinterface
shell script is the printer interface program as supplied to 
.I lpadmin.
The options are as specified in the
.I Line Printer Spooling Utilities Guide.
This shell script sources a printer-specific shell script named 
transcript/\fIprinter\fP.opt
below the current working directory (the lp spooling directory) which
may do additional printer-specific processing (e.g., specify 
no page reversal).  
.I psinterface
is responsible for the complete processing of the print job.
If job banner break pages are enabled for this printer (and requested
for this job),
.I psinterface
will invoke
.I psbanner
to format a banner break page.
.I psinterface
also distinguishes between text files (which get formatted) and \*(PS print 
files.  If the input to 
.I psinterface
does not begin with the \*(PS 
.B magic number
\- the first two characters being ``%!'' \-
.I psinterface
will invoke
.I pstext
to create a listing of the file.
If the first bytes of the input file are ``%!PS-Adobe-'',
and if the printer options so specify,
.I psinterface
will also page-reverse the file (with the
.I psrv
filter) before printing.
.I psinterface
currently recognizes three \*(TS-specific spooling options (presented to 
.I lp
with the
.B \-o
flag): the 
.B h
option suppresses the printing of a banner break page, the
.B r
option suppresses page reversal, and the 
.B m
option causes 
.I psinterface
to send any stream output from the execution of the user's \*(PS
print file back to the user as mail.
The program 
.I pscomm
is the lowest level filter.  It manages communication with the printer,
error handling, status reporting, etc.  
.I psinterface 
and 
.I pscomm
manage a printer log file named
transcript/\fIprinter\fP-log (under the lp spooling directory).
This file contains a log of each job processed, as well as any
error output from the printer.  In particular, it contains messages
reguarding paper-out, paper-jams, etc.  Doing a 
.I tail
on this file will help determine the printer's status.
.SH FILES
.TP
XPSLIBDIRX/
\*(PS library, prologues, filters, etc.
.TP
\fIspooldir\fP/transcript/\fIprinter\fP-log
Printer log file.
.TP
\fIspooldir\fP/transcript/\fIprinter\fP.opt
Printer-specific options script.
.TP
XPSTEMPDIRX/b*
Break page temporary generated by 
.IR psinterface/psbanner .
.TP
XPSTEMPDIRX/o*
Job output temporary for mail.
.TP
XPSTEMPDIRX/t*
Temporary file to format text files.
.SH "SEE ALSO"
lp(1), lpstat(1), lpsched(1M), lpadmin(1M).
.br
enscript(1), ps4014(1), ps630(1), pscat(1), psdit(1), psrev(1), psroff(1), ptroff(1).
.br
.I System V Line Printer Spooling Utilities
.SH AUTHOR
Adobe Systems Incorporated
.SH NOTES
\*(PS and \*(TS are trademarks of Adobe Systems Incorporated.
