JohnDTX/irix-3.x-src/man/u_man/man4/bellinode.4
'\"macro stdmacro
'\" t
.TH BELLINODE 4
.SH NAME
bellinode \- format of a Bell file system inode
.SH SYNOPSIS
.B #include <sys/param.h>
.br
.B #include <sys/inode.h>
.SH DESCRIPTION
An
.I inode
under the Bell file system
(formerly known as ``the''
U\s-2NIX\s+2
System V
file system)
has the following structure.
.PP
.nf
.in +.3i
/*
 * Bell style file system inode as it appears on disk.  The 40 bytes of
 * addressing information is divided into 13 3-byte addresses.  The Bell
 * inode is 64 bytes long.
 */
struct	dinode {
	ushort	di_mode;		/* type and access permissions */
	short	di_nlink;    		/* number of links */
	ushort	di_uid;      		/* owner's user id number */
	ushort	di_gid;      		/* group's group id number */
	off_t	di_size;     		/* number of bytes in file */
	char  	di_addr[40];		/* disk block addresses */
	time_t	di_atime;		/* time of last access (to contents) */
	time_t	di_mtime;		/* of last modification (of contents) */
	time_t	di_ctime;		/* of last modification to inode */
};
.in -.3i
.fi
.LP
The types
.IR ushort ,
.IR off_t ,
and
.I time_t
are defined in
.IR types (5).
.PP
.I di_mode
contains the type of the file
(plain file, directory, etc),
and its read, write, and execute permissions
for the file's owner, group, and public.
.I di_nlink
contains the number of links to the inode.
Correctly formed directories have
a minimum of two links:
a link in the directory's parent
and the `.' link in the directory itself.
Additional links may be caused by `..' links from subdirectories.
.I di_uid
and
.I di_gid
contain the user id and group id of the file
(used to determine which set of access permissions apply:
owner, group, or public).
.I di_size
contains the length of the file in bytes.
.PP
.I di_atime
is the time of last access to the file's contents.
.I di_mtime
is the time of last modification of the file's contents.
.I di_ctime
is the time of last modification of the inode,
as opposed to the contents of the file it represents.
These times are in given in seconds since
the beginning of 1970 GMT.
.PP
.I "di_addr[0 .. 38]"
is a packed array of
13
3-byte numbers.
If the inode is not a block or character special inode,
the first
10
are volume block addresses of the file's first 10 data blocks.
Next is
the address of a
single indirect block
containing block addresses,
followed by the address of a
double indirect block
containing addresses of single indirect blocks,
followed by the address of a
triple indirect block
containing addresses of double indirect blocks.
If 0 appears as a direct or indirect block address,
the corresponding block is read by the system as all zeros.
.PP
If the inode is a block or character special inode,
only the first number is used,
as a number identifying the device.
.SH SEE ALSO
stat(2), inode(4), fs(4), bellfs(4), types(5).
.\"	@(#)inode.4	5.1 of 10/15/83
