JohnDTX/irix-3.x-src/man/u_man/man4/gettydefs.4
'\"macro stdmacro
.ds P UNIX
.TH GETTYDEFS 4
.SH NAME
gettydefs \- speed and terminal settings used by getty
.SH SYNOPSIS
.B /etc/gettydefs
.SH DESCRIPTION
The
.B /etc/gettydefs
file contains information used by
.IR getty (1M)
(see the
.IR "\*P Programmer's Manual" )
to set up the speed and terminal settings for a line.
It supplies information on what the
.I login
prompt should look like.
It also supplies
the speed to try next if
the user indicates the current speed is not correct by
typing a
.I <break>
character.
.PP
Each entry in
.B /etc/gettydefs
has the following format:
.PP
.RS
label# initial-flags # final-flags # login-prompt #next-label
.RE
.PP
Each entry is followed by a blank line.
Lines that begin with
.B #
are ignored and may be used to comment the file.
The various fields can contain quoted characters of the form
.BR \eb ,
.BR \en ,
.BR \ec ,
etc., as well as
.BI \e nnn\f1,\fP
where
.I nnn
is the
octal value of the desired character.  The various fields are:
.TP \w'login-prompt\ \ \ 'u
.I label
This is the string against which
.I getty
tries to match its second argument.
It is often the speed, such as \f31200\fP, at which the terminal
is supposed to run, but it needn't be
(see
below).
.TP
.I initial-flags
These flags are the initial
.IR ioctl (2)
settings to which the terminal is to be set if
a terminal type is not specified to
.IR getty .
.I Getty
understands the symbolic names specified in
.B <sys/termio.h>
(see
.IR termio (7)).
Normally only the speed flag is required in the
.IR initial-flags .
.I Getty
automatically sets the terminal to raw input mode and
takes care of most of the other flags.
The \f2initial-flag\fP settings remain in effect until
.I getty
executes
.IR login (1).
.TP
.I final-flags
These flags take the same values as the
.I initial-flags
and are set just prior to
.I getty
executes
.IR login .
The speed flag is again required.  The composite
flag
.SM
.B SANE
takes care of most of the other flags that need to be
set so that the processor and terminal are communicating
in a rational fashion.  The other two commonly specified
.I final-flags
are
.SM
.BR TAB3\*S ,
so that tabs are sent to the terminal as spaces, and
.SM
.BR HUPCL\*S ,
so that the line is hung up on the final close.
.TP
.I login-prompt
This entire field is printed as the \f2login-prompt\fP.  Unlike the above
fields where white space is ignored 
(a space, tab or new-line),
they are included in the
.I login-prompt
field. If '$HOSTNAME' is included in this field, it will be
replaced by the machine name set by \f2hostname\f1(1).
.TP
.I next-label
This indicates the next
.I label
of the entry in the table that
.I getty
should use if the user types a
.I <break>
or the input cannot be read.
Usually, a series of speeds are linked together in this fashion, into
a closed set.  For instance, \f32400\fP linked to \f31200\fP, which in turn is
linked to \f3300\fP, which finally is linked to \f32400\fP.
.PP
If
.I getty
is called without a second argument, then the first entry of
.B /etc/gettydefs
is used, thus making the first entry of
.B /etc/gettydefs
the default entry.  It is also used if
.I getty
can't find the specified
.IR label .
If
.B /etc/gettydefs
itself is missing, there is one entry built into
the command which will bring up a terminal at \f3300\fP baud.
.PP
It is strongly recommended that after making or modifying
.BR /etc/gettydefs ,
it be run through
.I getty
with the check option to be sure there are no errors.
.SH FILES
/etc/gettydefs
.SH "SEE ALSO"
getty(1M),
login(1),
ioctl(2),
termio(7).
.\"	@(#)gettydefs.4	5.1 of 10/23/83
