JohnDTX/irix-3.x-src/man/u_man/man4/protocols.4
'\"macro stdmacro
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)protocols.5	6.2 (Berkeley) 5/6/86
.\"
.TH PROTOCOLS 4
.UC 5
.SH NAME
protocols \- protocol name data base 
.SH SYNOPSIS
.B /etc/protocols
.SH DESCRIPTION
The
.I protocols
file contains information regarding the known protocols used in the DARPA
Internet.  For each protocol a single line should be present
with the following information:
.HP 10
official protocol name
.br
.ns
.HP 10
protocol number
.br
.ns
.HP 10
aliases
.PP
Items are separated by any number of blanks and/or
tab characters.  A ``#'' indicates the beginning of
a comment; characters up to the end of the line are
not interpreted by routines which search the file.
.PP
Protocol names may contain any printable
character other than a field delimiter, newline,
or comment character.
.SH FILES
/etc/protocols
.SH "SEE ALSO"
getprotoent(3N)
.SH BUGS
A name server should be used instead of a static file.
