JohnDTX/irix-3.x-src/man/u_man/man4/rcsfile.4
'\"macro stdmacro
.TH RCSFILE 4
.SH NAME
rcsfile \- format of RCS file
.SH DESCRIPTION
An RCS file is an ASCII file. Its contents are described by the grammar
below. The text is free format, i.e., spaces, tabs and new lines have
no significance except in strings. Strings are enclosed by `@'.
If a string contains a `@', it must be doubled.
.PP
The meta syntax uses the following conventions: `|' (bar) separates
alternatives; `{' and `}' enclose optional phrases; `{' and `}*' enclose
phrases that may be repeated zero or more times;
`{' and '}+' enclose phrases that must appear at least once and may be
repeated;
`<' and `>' enclose nonterminals.
.PP
.ta 1.0i 1.5i 3i
.fc ~
.nf

 
<rcstext>  ~~::=~~<admin> {<delta>}* <desc> {<deltatext>}*
           
<admin>    ~~::=~~\f3head\f1     ~~{<num>};
           ~~   ~~\f3access\f1   ~~{<id>}*;
           ~~   ~~\f3symbols\f1  ~~{<id> : <num>}*;  
           ~~   ~~\f3locks\f1    ~~{<id> : <num>}*;
           ~~   ~~\f3comment\f1  ~~{<string>};
           
<delta>    ~~::=~~<num>
           ~~   ~~\f3date\f1     ~~<num>;
           ~~   ~~\f3author\f1   ~~<id>;
           ~~   ~~\f3state\f1    ~~{<id>};
           ~~   ~~\f3branches\f1 ~~{<num>}*;
           ~~   ~~\f3next\f1     ~~{<num>};
           
<desc>     ~~::=~~\f3desc\f1     ~~<string>

<deltatext>~~::=~~<num>   
           ~~   ~~\f3log\f1      ~~<string>
           ~~   ~~\f3text\f1     ~~<string>


<num>      ~~::=~~{<digit>{.}}+
             
<digit>    ~~::=~~0 | 1 | ... | 9
             
<id>       ~~::=~~<letter>{<idchar>}*

<letter>   ~~::=~~A | B | ... | Z | a | b | ... | z

<idchar>   ~~::=~~Any printing ASCII character except space,
           ~~   ~~tab, carriage return, new line, and <special>.

<special>  ~~::=~~; | : | , | @

<string>   ~~::=~~@{any ASCII character, with `@' doubled}*@

.fi
.PP
Identifiers are case sensitive. Keywords are in lower case only.
The sets of keywords and identifiers may overlap.
.PP
The <delta> nodes form a tree. All nodes whose numbers
consist of a single pair
(e.g., 2.3, 2.1, 1.3, etc.)
are on the ``trunk'', and are linked through the ``next''
field in order of decreasing numbers. The ``head'' field in the
<admin> node points to the head of that sequence (i.e., contains
the highest pair). 
.PP
All <delta> nodes whose numbers consist of 2n fields (n\(>=2)
(e.g., 3.1.1.1, 2.1.2.2, etc.)
are linked as follows. All nodes whose first (2n)-1 number fields are identical
are linked through the ``next'' field in order of increasing numbers.
For each such sequence, 
the <delta> node whose number is identical to the first 
2(n-1) number fields of the deltas on that sequence is called the branchpoint.
The ``branches'' field of a node contains a list of the
numbers of the first nodes of all sequences for which it is a branchpoint.
This list is ordered in increasing numbers.
.bp
Example:
.nf
.vs 12pts
.ce
Head\0\0\0\0\0\0\0\0\0\0
.cs 1 15

                                      |
                                      |
                                      v
                                  ---------
            / \\          / \\      |       |      / \\           / \\     
           /   \\        /   \\     |  2.1  |     /   \\         /   \\
          /     \\      /     \\    |       |    /     \\      /       \\
         /1.2.1.3\\    /1.3.1.1\\   |       |   /1.2.2.2\\   /1.2.2.1.1.1\\
         ---------    ---------   ---------   ---------   -------------
             ^            ^           |           ^             ^
             |            |           |           |             |
             |            |           v           |             |
            / \\           |       ---------      / \\            |
           /   \\          |       \\  1.3  /     /   \\           |
          /     \\         ---------\\     /     /     \\-----------
         /1.2.1.1\\                  \\   /     /1.2.2.1\\           
         ---------                   \\ /      --------- 
             ^                        |           ^     
             |                        |           |     
             |                        v           |     
             |                    ---------       |     
             |                    \\  1.2  /       |     
             ----------------------\\     /---------     
                                    \\   /               
                                     \\ /                
                                      |                 
                                      |                 
                                      v                 
                                  ---------             
                                  \\  1.1  /             
                                   \\     /              
                                    \\   /               
                                     \\ /                
                                                        

.cs 1
.ce
Fig. 1: A revision tree
.fi
.PP
.ne 10v
.SH IDENTIFICATION
Author: Walter F. Tichy,
.br
Purdue University, West Lafayette, IN, 47907.
.br
Copyright \(co 1982 by Walter F. Tichy.
.SH SEE ALSO
ci(1), co(1), ident(1), rcs(1), rcsdiff(1), rcsintro(1), rcsmerge(1), rlog(1).
