JohnDTX/irix-3.x-src/man/u_man/man4/rpc.4
'\"macro stdmacro
.TH RPC 4
.SH NAME
rpc \- rpc program number data base
.SH SYNOPSIS
.B /etc/rpc
.SH DESCRIPTION
The
.I rpc
file contains user readable names that
can be used in place of rpc program numbers.
Each line has the following information:
.HP 10
name of server for the rpc program
.br
.ns
.HP 10
rpc program number
.br
.ns
.HP 10
aliases
.LP
Items are separated by any number of blanks and/or
tab characters.
A ``#'' indicates the beginning of a comment; characters up to the end of
the line are not interpreted by routines which search the file.
.LP
Here is an example of the \f2/etc/rpc\fP file from the UNIX
System.
.nf
#
#	rpc   1.2   86/01/07
#
rstatd		100001	rstat rup perfmeter
rusersd		100002	rusers
nfs		100003	nfsprog
ypserv		100004	ypprog
mountd	100005  mount showmount
ypbind		100007
walld		100008	rwall shutdown
yppasswdd	100009	yppasswd
sprayd		100012	spray
.ta 1.0i +1.0i +1.0i +1.0i
.fi
.DT
.SH FILES
/etc/rpc
.SH "SEE ALSO"
getrpcent(3R).
