JohnDTX/irix-3.x-src/man/u_man/man4/services.4
'\"macro stdmacro
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)services.4	6.2 (Berkeley) 5/6/86
.\"
.TH SERVICES 4
.UC 5
.SH NAME
services \- service name data base
.SH SYNOPSIS
.B /etc/services
.SH DESCRIPTION
The
.I services
file contains information regarding
the known services available in the DARPA Internet.
For each service a single line should be present
with the following information:
.HP 10
official service name
.br
.ns
.HP 10
port number
.br
.ns
.HP 10
protocol name
.br
.ns
.HP 10
aliases
.PP
Items are separated by any number of blanks and/or
tab characters.  The port number and protocol name
are considered a single 
.IR item ;
a ``/'' is used to
separate the port and protocol (e.g. ``512/tcp'').
A ``#'' indicates the beginning of
a comment; characters up to the end of the line are
not interpreted by routines which search the file.
.PP
Service names may contain any printable
character other than a field delimiter, newline,
or comment character.
.SH FILES
/etc/services
.SH "SEE ALSO"
getservent(3N)
.SH BUGS
A name server should be used instead of a static file.
