JohnDTX/irix-3.x-src/man/u_man/man1/lp.1
'\"macro stdmacro
.ds P UNIX
.TH LP 1
.SH NAME
lp, cancel \- send/cancel requests to an \s-1LP\s+1 line printer
.SH SYNOPSIS
.B lp
.RB [ \-c ]
.RB [ \-d \^dest]
.RB [ \-m ]
.RB [ \-n \^number]
.RB [ \-o \^option]
.RB [ \-s ]
.RB [ \-t \^title]
.RB [ \-w ]
files
.br
.B cancel
[\|ids\|] [\|printers\|]
.SH DESCRIPTION
.I Lp\^
arranges
for the named files
and associated information
(collectively called a
.IR request\^ )
to be printed
by a line printer.
If no file names
are mentioned,
the standard input
is assumed.
The file name
.B \-
stands for
the standard input
and may be supplied
on the command line
in conjunction
with named
.IR files .
The order
in which
.I files\^
appear
is the same order
in which they will be printed.
.PP
.I Lp\^
associates
a unique
.I id\^
with each request
and prints it
on the standard output.
This
.I id\^
can be used later
to cancel
(see below)
or find the status
(see
.IR lpstat\^ (1))
of the request.
.PP
The following options
to
.I lp\^
may appear
in any order
and may be intermixed
with file names:
.TP "\w'\f3\-n\^\f2number\f1\ \ 'u"
.B \-c
Make copies
of the
.I files\^
to be printed
immediately when
.I lp\^
is invoked.
Normally,
.I files\^
will not be copied,
but will be linked
whenever possible.
If the
.B \-c
option is not given,
then the user
should be careful
not to remove
any of the
.I files\^
before the request
has been printed
in its entirety.
It should also be noted
that in the absence
of the
.B \-c
option,
any changes made
to the named
.I files\^
after the request
is made
but before it is printed
will be reflected
in the printed output.
.TP
.BI \-d\| dest
Choose
.I dest\^
as the printer
or class of printers
that is
to do the printing.
If
.I dest\^
is a printer,
then the request
will be printed only
on that specific printer.
If
.I dest\^
is a class of printers,
then the request
will be printed
on the first available printer
that is a member
of the class.
Under certain conditions
(printer unavailability,
file space limitation,
etc.),
requests for
specific destinations
may not be accepted
(see
.IR accept\^ (1M)
and
.IR lpstat\^ (1)).
By default,
.I dest\^
is taken from
the environment variable
.SM
.B LPDEST
(if it is set).
Otherwise,
a default destination
(if one exists)
for the computer system
is used.
Destination names vary
between systems
(see
.IR lpstat\^ (1)).
.TP
.B \-m
Send mail
(see
.IR mail\^ (1))
after the files
have been printed.
By default,
no mail is sent
upon normal completion
of the print request.
.TP
.BI \-n\| number
Print
.I number\^
copies (default of 1) of the output.
.TP
.BI \-o\| option
Specify printer-dependent or class-dependent
.IR options .
Several such
.I options\^
may be collected
by specifying the
.B \-o
keyletter more than once.
For more information about what is valid
for
.IR options ,
see
.I Models
in
.IR lpadmin\^ (1M).
.TP
.B \-s
Suppress messages from
.IR lp\^ (1)
such as "request id is ...".
.TP
.BI \-t\| title
Print
.I title\^
on the banner page
of the output.
.TP
.B \-w
Write a message
on the user's
terminal after the
.I files\^
have been printed.
If the user
is not logged in,
then mail will be sent instead.
.PP
.I Cancel\^
cancels line printer requests
that were made by the
.IR lp\^ (1)
command.
The command line arguments
may be either request
.I ids\^
(as returned by
.IR lp\^ (1))
or
.I printer\^
names
(for a complete list,
use
.IR lpstat\^ (1)).
Specifying a request
.I id\^
cancels the associated request
even if it is currently printing.
Specifying a
.I printer\^
cancels the request
which is currently printing
on that printer.
In either case,
the cancellation
of a request
that is currently printing
frees the printer
to print its next available request.
.SH FILES
/usr/spool/lp/\(**
.SH SEE ALSO
enable(1),
lpstat(1),
mail(1).
.br
accept(1M),
lpadmin(1M),
lpsched(1M)
.\"	@(#)lp.1	5.1 of 11/8/83
