JohnDTX/irix-3.x-src/man/u_man/man1/rwho.1c
'\"macro stdmacro
.TH RWHO 1C
.UC 5
.SH NAME
rwho \- who's logged in on local machines 
.SH SYNOPSIS
.B rwho
[
.B \-a
]
.SH DESCRIPTION
The
.I rwho
command produces output similar to
.I who,
but for all machines on the local network.
If no report has been
received from a machine for 5 minutes then
.I rwho
assumes the machine is down, and does not report users last known
to be logged into that machine.
.PP
If a users hasn't typed to the system for a minute or more, then
.I rwho
reports this idle time.  If a user hasn't typed to the system for
an hour or more, then
the user will be omitted from the output of
.I rwho
unless the
.B \-a
flag is given.
.SH FILES
/usr/spool/rwho/whod.*	 information about other machines
.SH SEE ALSO
ruptime(1C),
rwhod(1M)
.SH BUGS
This is unwieldy when the number of machines
on the local net is large.
