JohnDTX/irix-3.x-src/man/u_man/man1/uux.1c
'\"macro stdmacro
.ds P UNIX
.TH UUX 1C
.SH NAME
uux \- unix to unix command execution
.SH SYNOPSIS
.B uux
[
options
]
command-string
.SH DESCRIPTION
.I Uux\^
will gather zero or more files from various systems,
execute a command on a specified system
and then send standard output to a file on a specified
system.
Note that, for security reasons, many installations will
limit the list of
commands executable on behalf of an incoming request from
.IR uux .
Many sites will permit little more than
the receipt of mail (see
.IR mail\^ (1))
via 
.IR uux .
.PP
The \f2command-string\^\fP is made up of one or more arguments that look
like a Shell command line,
except that the command and file names
may be prefixed by
.IB system-name !\f1.\fP
A null \f2system-name\^\fP is interpreted as the local system.
.PP
File names may be one of
.IP "(1)" .3i
a full path name;
.IP "(2)" .3i
a path name preceded by
.RI ~ xxx\^
where
.I xxx\^
is a login name on the specified system
and is replaced by that user's login directory;
.IP "(3)"
anything else is prefixed by the current directory.
.PP
Any special shell characters such as \f3<>;\f1\||\| should be quoted either
by quoting the entire \f2command-string\fP, or quoting the special
characters as individual arguments.
.PP
.I Uux\^
will attempt to get all files to the execution system.
For files which are output files, the file name must be escaped using
parentheses.
.PP
.I Uux\^
will notify you if the requested command on the remote
system was disallowed.
The response comes by remote mail from the remote machine.
.PP
The following \f2options\^\fP are interpreted by
.IR uux :
.TP "\w'\f3\-m\|\f2file\f1\^\ \ 'u"
.B \-
The standard input to
.I uux\^
is made the standard input to the
.IR command-string .
.TP 
.B \-n
Send no notification to user.
.TP 
.BI \-m\| file\^
Report status of the transfer in
.IR file .
If
.I file\^
is omitted, send mail to the requester when the copy is
completed.
.PP
.I Uux\^
returns an \s-1ASCII\s+1 string on the standard output which is the job number.
This job number can be used by
.I uustat\^
to obtain the status 
or terminate a job.
.SH EXAMPLE
.IP
uux "\^!diff usg!/usr/dan/f1 pwba!/a4/dan/f1 > !f1.diff\^"
.PP
will get the "f1" files from the 
.B usg 
and 
.B pwba
machines,
execute a
.I diff\^
command
and put the results in "f1.diff" in the local directory.
.IP
uux a!uucp b!/usr/file \\(c!/usr/file\\)
.PP
will send a \f2uucp\^\fP command to system 
.B a
to get
\f3/usr/file\fP from system 
.B b 
and send it to system 
.BR c .
.SH FILES
.ta \w'/usr/lib/uucp/\s-1SYSTEMNAME\s+1\ \ \ 'u 
/usr/lib/uucp/L.sys	List of system names and when to call them
.br
/usr/lib/uucp/L.cmds	List of commands for
.I uuxqt\^
to execute
.br
/usr/lib/uucp/L-devices	List of device codes and speeds
.br
/usr/lib/uucp/L-dialcodes	List of phone numbers in L.sys
.br
/usr/lib/uucp/\s-1USERFILE\s+1	List of users and required pathname 
.br
	prefixes
.br
/usr/lib/uucp/uucico	copy in, copy out program; called by
.I uucp
.br
/usr/lib/uucp/uuclean	spool directory cleanup program; called by
.br
	\f2uucp\fP
.br
/usr/lib/uucp/uuxqt	command execution program; called by
.I uucp
.br
/usr/spool/uucp	spool directory
.SH SEE ALSO
uucp(1C)
.br
uuclean(1M)
.SH BUGS
Only the first command of a shell pipeline may
have a
.IB system-name !\f1.
All other commands are executed on the system of the first
command.
.br
The use of the shell metacharacter
.B \(**
will probably not do what you want it to do.
The shell tokens
.B <<
and
.B >>
are not implemented.
.\"	@(#)uux.1c	5.1 of 11/14/83
