JohnDTX/irix-3.x-src/man/trash/standard/u_man/man4/tp.4
'\" t
.TH TP 4 
.SH NAME
tp \- magnetic tape format
.SH DESCRIPTION
The
command
.IR tp (1)
dumps files to and extracts files from
magtape.
.PP
Block zero contains a
copy of a stand-alone bootstrap program.
.PP
Blocks 1 through 62
contain a directory of the tape.
There are 496 entries in the directory;
8 entries per block;
64 bytes per entry.
Each entry has the following format:
.PP
.RS .3i
.TS
l l l l.
struct	tpent {
	char	pathnam[32];
	short	mode;
	char	uid;
	char	uid;
	char	gid;
	char	spare;
	char	size0;
	short	size2;
	long	time;
	short	tapea;	/\(** tape address \(**/
	short	unused[8];
	short	cksum;	/\(** check sum \(**/
}
.TE
.RE
.PP
The
.I pathnam\^
entry is the path name of the
file when put on the tape.
If the path name starts with a zero word,
the entry is empty.
It is at most 32 bytes long and ends in a null byte.
.IR Mode ,
.IR uid ,
.IR gid ,
the sizes and time modified
are the same as described under i-nodes
.RI ( fs (4)).
The tape address is the tape block number of the start of
the contents of the file.
Every file
starts on a block boundary.
The file occupies (size+511)/512 blocks
of continuous tape.
The checksum entry has a value such that
the sum of the 32 words of the directory entry is zero.
.PP
Blocks 63 on are available for file storage.
.PP
A fake entry has a size of zero.
See
.IR tp (1).
.SH "SEE ALSO"
cpio(1),
tp(1),
fs(4).
.\"	@(#)tp.4	5.1 of 10/18/83
