JohnDTX/irix-3.x-src/man/a_man/man7/lo.7
'\"macro stdmacro
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)lo.4	6.3 (Berkeley) 5/21/86
.\"
.TH LO 7
.UC 5
.SH NAME
lo \- software loopback network interface
.SH SYNOPSIS
.B pseudo-device loop
.SH DESCRIPTION
The
.I loop
interface is a software loopback mechanism which may be
used for performance analysis, software testing, and/or local
communication.
As with other network interfaces, the loopback interface must have
network addresses assigned for each address family with which it is to be used.
These addresses
may be set or changed with the SIOCSIFADDR ioctl.
The loopback interface should be the last interface configured,
as protocols may use the order of configuration as an indication of priority.
The loopback should \f3never\fP be configured first unless no hardware
interfaces exist.
.SH DIAGNOSTICS
\f3lo%d: can't handle af%d\fP.  The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
.SH SEE ALSO
inet(7P)
.SH BUGS
Previous versions of the system enabled the loopback interface
automatically, using a nonstandard Internet address (127.1).
Use of that address is now discouraged; a reserved host address
for the local network should be used instead.
